HANGMAN = [
    """
         ------
         |    |
         |
         |
         |
         |
         |
        ----------
        """,
    """
         ------
         |    |
         |    O
         |
         |
         |
         |
        ----------
        """,
    """
         ------
         |    |
         |    O
         |    |
         | 
         |   
         |    
        ----------
        """,
    """
         ------
         |    |
         |    O
         |   /|
         |   
         |   
         |   
        ----------
        """,
    """
         ------
         |    |
         |    O
         |   /|\\
         |   
         |   
         |     
        ----------
        """,
    """
         ------
         |    |
         |    O
         |   /|\\
         |   /
         |   
         |    
        ----------
        """,
    """
         ------
         |    |
         |    O
         |   /|\\
         |   / \\
         |   
         |   
        ----------
        """
]

ru_alphabet = {"а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о",
               "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я"}

WORDS = ["слово", "игра", "стол", "стул", "курс", "сибгути", "мышь", "экран", "кнопка", "код"]

rerun_game = "Давай сыграем еще? y = yes, n = no, работает да/нет \n"

answer = ["y", "n", "yes", "no", "да", "нет"]

pos_answer = ["y", "yes", "да"]
